app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    @auctions = Auction.all