app/controllers/api/v1/bids_controller.rb

  def index
    @bids = Bid.all
---
SELECT "bids".* FROM "bids"