app/controllers/api/v1/items_controller.rb

  def find_item
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]